# Taps
# ----------------------------------------------------------
tap "homebrew/cask-versions"
tap "FelixKratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "homebrew/bundle"

# Formula
# ----------------------------------------------------------
brew "python3"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
# ----------------------------------------------------------
cask "alt-tab"
cask "firefox"
cask "google-chrome"
cask "hiddenbar"
cask "homebrew/cask-fonts/font-roboto-mono-nerd-font"
cask "iterm2"
cask "logi-options-plus"
cask "obs"
cask "rectangle"
cask "reaper"
cask "stretchly"
cask "visual-studio-code"

# Mas (app store applications)
# ----------------------------------------------------------