# Taps
# ----------------------------------------------------------
tap "homebrew/cask-versions"
tap "FelixKratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "homebrew/bundle"

# Formula
# ----------------------------------------------------------
brew "neovim"
brew "powershell/tap/powershell"
brew "python3"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
# ----------------------------------------------------------
cask "alt-tab"
cask "firefox"
cask "google-chrome"
cask "hiddenbar"
cask "homebrew/cask-fonts/font-roboto-mono-nerd-font"
cask "iterm2"
cask "logi-options-plus"
cask "obs"
cask "rectangle"
cask "reaper"
cask "stretchly"
cask "visual-studio-code"

# Visual Studio Code Extensions
# ----------------------------------------------------------
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-xml"

# Mas (app store applications)
# ----------------------------------------------------------